-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost:8889
-- Generation Time: 2019 年 8 月 23 日 07:02
-- サーバのバージョン： 5.7.25
-- PHP Version: 7.3.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

CREATE DATABASE onsens;
USE onsens;
--
-- Database: `onsens`
--


--
-- テーブルの構造 `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `created` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `users`
--

INSERT INTO `users` (`id`, `name`, `password`, `created`) VALUES
(1, 'test', 'a94a8fe5ccb19ba61c4c0873d391e987982fbbd3', '2019-08-22 20:49:28');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;


-- --------------------------------------------------------

--
-- テーブルの構造 `onsen`
--

CREATE TABLE `onsen` (
  `id` int(11) NOT NULL,
  `name` varchar(1000) DEFAULT NULL,
  `map` varchar(1000) DEFAULT NULL,
  `picture_id` int(10) DEFAULT NULL,
  `prefecture` varchar(10) DEFAULT NULL,
  `p_id` int(10) DEFAULT NULL,
  `adress` varchar(1000) DEFAULT NULL,
  `eat` varchar(10) DEFAULT NULL,
  `sauna` varchar(10) DEFAULT NULL,
  `towel` varchar(10) DEFAULT NULL,
  `towel_text` varchar(50) DEFAULT NULL,
  `hot_stone` varchar(10) DEFAULT NULL,
  `open_bath` varchar(10) DEFAULT NULL,
  `time_opne` time(1) DEFAULT NULL,
  `time_close` time(1) DEFAULT NULL,
  `w_time_opne` time(1) DEFAULT NULL,
  `w_time_close` time(1) DEFAULT NULL,
  `h_time_opne` time(1) DEFAULT NULL,
  `h_time_close` time(1) DEFAULT NULL,
  `w_a_fee` varchar(10) DEFAULT NULL,
  `w_c_fee` varchar(10) DEFAULT NULL,
  `h_a_fee` varchar(10) DEFAULT NULL,
  `h_c_fee` varchar(10) DEFAULT NULL,
  `close_text` varchar(50) DEFAULT NULL,
  `close` varchar(10) DEFAULT NULL,
  `jaf_url` varchar(1000) DEFAULT NULL,
  `nifty_url` varchar(1000) DEFAULT NULL,
  `onsen_url` varchar(1000) DEFAULT NULL,
  `blog_url` varchar(1000) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `onsen`
--

INSERT INTO `onsen` (`id`, `name`, `map`, `picture_id`, `prefecture`, `p_id`, `adress`, `eat`, `sauna`, `towel`, `towel_text`, `hot_stone`, `open_bath`, `time_opne`, `time_close`, `w_time_opne`, `w_time_close`, `h_time_opne`, `h_time_close`, `w_a_fee`, `w_c_fee`, `h_a_fee`, `h_c_fee`, `close_text`, `close`, `jaf_url`, `nifty_url`, `onsen_url`, `blog_url`) VALUES
(1, '青根緑の休暇村 いやしの湯', '35.54854298985728%2C139.13524004655756&z=16', 1, '神奈川県', 1, '神奈川県相模原市緑区青根８０７−２', '◯', '◯', '◯', '販売のみ取り扱ってる。', '×', '◯', '10:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '700', '400', '', '', '', '火曜日', '', '', 'http://www.iyashinoyu.org/', 'iyasinoyu/'),
(2, 'かくれ湯の里 信玄館', '35.44268799088018%2C139.04834134655766&z=16', 2, '神奈川県', 1, '神奈川県足柄上郡山北町中川５７７−６', '×', '◯', '◯', 'フェイスタオルのみ販売。', '×', '◯', '11:30:00.0', '18:00:00.0', '11:30:00.0', '18:00:00.0', '11:30:00.0', '17:00:00.0', '1000', '500', '1000', '500', '', '年中無休', '141314X00276&exec_mode=1&SsnId=', 'tanzawa-onsen/onsen001587/', 'http://www.shingenkan.co.jp/', 'singenkan/'),
(3, '中川温泉 ぶなの湯', '35.4446908388727%2C139.04915030422967&z=16', 3, '神奈川県', 1, '神奈川県足柄上郡山北町中川645-8', '×', '×', '◯', '', '×', '◯', '10:00:00.0', '18:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '700', '400', '', '', '', '月曜日', '', '', 'http://www.town.yamakita.kanagawa.jp/0000004011.html', 'bunanoyu/'),
(4, '丹沢ホテル時之栖', '35.440133173515264%2C139.0454304312134&z=16', 4, '神奈川県', 1, '神奈川県足柄上郡山北町中川448−2', '×', '×', '◯', '', '×', '◯', '12:00:00.0', '22:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '600', '300', '800', '500', '', '年中無休', '221114X00850&exec_mode=1&SsnId=', '', 'http://www.tokinosumika.com/tanzawa/', 'tanzawahotle/'),
(5, '休暇村富士', '35.342098255569844%2C138.5528735980888&z=16', 5, '静岡県', 2, '静岡県富士宮市佐折６３４', '×', '◯', '◯', '', '×', '×', '11:00:00.0', '14:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '800', '400', '1000', '500', '', '火曜日', '221122X00736&exec_mode=1&SsnId=', '', 'https://www.qkamura.or.jp/fuji/', 'qkamurafuji/'),
(6, 'ヘルシーパーク裾野', '35.24827685202444%2C138.87157593121333&z=16', 6, '静岡県', 2, '静岡県裾野市須山３４０８', '◯', '◯', '◯', '', '×', '◯', '09:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '520', '260', '', '', '6月第３月曜日〜木曜日の４日間', '木曜日', '221122X01029&exec_mode=1&SsnId=', '', 'http://www.susono-shinkou.jp/', 'healthyparksusono/'),
(7, '天然温泉ざぶ〜ん', '35.12971260000002%2C138.80046390000007&z=16', 7, '静岡県', 2, '静岡県沼津市原町中２丁目１４−８', 'ある', 'ある', 'ある', '販売のみ', 'ない', 'ある', '09:00:00.0', '26:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '780', '440', '830', '490', '', '年中無休', '', 'numadu-onsen/onsen008214/', 'http://joyland.jp/contents/spa/access.html', 'zabooon/'),
(8, '富士山天母の湯', '35.28031309999998%2C138.63857800000005&z=16', 8, '静岡県', 2, '静岡県富士宮市山宮３６７０−１', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '20:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '720', '360', '', '', '祝日の場合は翌日が休み', '月曜日', '', '', 'http://www.anmonoyu.com/', 'fujisananmonoyu/'),
(9, 'あさぎり温泉 風の湯', '35.328070999999994%2C138.59367999999995&z=16', 9, '静岡県', 2, '静岡県富士宮市上井出3470-1', '◯', '◯', '◯', '', '◯', '◯', '10:00:00.0', '22:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '900', '500', '', '', '祝日の場合は翌日が休み', '火曜日', '', '', 'https://www.kazenoyu.net/', 'kazenoyu/'),
(10, 'なんぶの湯', '35.280909464660766%2C138.46295314655765&z=16', 10, '山梨県', 3, '山梨県南巨摩郡南部町内船８１０６−１', '◯', '◯', '◯', '', '×', '◯', '09:30:00.0', '20:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '820', '410', '', '', '', '月曜日', '', '', 'http://nanbunoyu.chu.jp/', 'nanbunoyu/'),
(11, '駿河の湯 坂口屋', '35.13932460412845%2C138.86832193121336&z=16', 11, '静岡県', 2, '静岡県沼津市岡宮１２６５−３', '◯', '◯', '◯', '', '◯', '◯', '10:00:00.0', '23:30:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1100', '400', '1300', '500', '８月は無休', '第３木曜日', '221122X00083&exec_mode=1&SsnId=', '', 'https://www.suruganoyu.co.jp/', 'sakagutiya/'),
(12, '沼津・湯河原温泉 万葉の湯', '35.13571072666722%2C138.87121184655757&z=16', 12, '静岡県', 2, '静岡県沼津市岡宮１２０８−１', '◯', '◯', '◯', '', '×', '◯', '24:00:00.0', '24:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1520', '710', '2000', '950', '臨時休業あり', '年中無休', '221122186003&exec_mode=1&SsnId=', 'numadu-onsen/onsen005734/', 'https://www.manyo.co.jp/numazu/', 'manyounoyu/'),
(13, '湯郷三島温泉', '35.161198386306616%2C138.94858314655767&z=16', 13, '静岡県', 2, '静岡県三島市徳倉1195', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '22:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '720', '360', '800', '400', '', '年中無休', '221122X01023&exec_mode=1&SsnId=', 'mishima-onsen/onsen006298/', 'https://yugo.co.jp/', 'yugoumisima/'),
(14, '極楽湯 三島店', '35.11131691588659%2C138.9070322465576&z=16', 14, '静岡県', 2, '静岡県三島市三好町４−番23号 せせらぎパーク三好内', '◯', '◯', '◯', '', '×', '◯', '09:00:00.0', '02:00:00.0', '00:00:00.0', '00:00:00.0', '06:00:00.0', '02:00:00.0', '750', '410', '800', '460', '', '年中無休', '2711Y0001469&exec_mode=1&SsnId=', 'mishima-onsen/onsen007958/', 'https://www.gokurakuyu.ne.jp/tempo/mishima/', 'gokurakumisima/'),
(15, '天然温泉 気楽坊', '35.23608727322712%2C138.92535426190182&z=16', 15, '静岡県', 2, '静岡県御殿場市神山719番地', '◯', '◯', '◯', '', '×', '◯', '10:30:00.0', '24:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1500', '700', '2000', '1000', '', '年中無休', '22112229J002&exec_mode=1&SsnId=', 'gotenba-onsen/onsen002686/', 'http://www.tokinosumika.com/spa/kirakubo/', 'kirakubou/'),
(16, '富士八景の湯', '35.28968827400202%2C138.97142000422969&z=16', 16, '静岡県', 2, '静岡県御殿場市深沢2564-19', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '22:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1000', '500', '1300', '600', '', '木曜日', '221122X00440&exec_mode=1&SsnId=', '', 'http://www.fujihakkei.jp/', 'fuji8/'),
(18, 'あしがら温泉', '35.32827021614225%2C138.97263186190185&z=16', 18, '静岡県', 2, '静岡県駿東郡小山町竹之下４５６-１', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '22:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '500', '250', '', '', '', '木曜日', '', '', 'http://www.ashigaraonsen.com/', 'asigaraonsen/'),
(19, '御胎内温泉健康センター', '35.29712344539102%2C138.86707084655768&z=16', 19, '静岡県', 2, '静岡県御殿場市印野１３８０－２５', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '500', '300', '700', '400', '', '火曜日', '', '', 'http://www.otainai-onsen.gr.jp/', 'otainaionsen/'),
(20, 'ふじやま温泉', '35.48452818095575%2C138.77893074655765&z=16', 20, '山梨県', 3, '山梨県富士吉田市新西原四丁目17番1号', '◯', '◯', '◯', '', '◯', '◯', '10:00:00.0', '22:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1400', '700', '1700', '850', '', '年中無休', '191119X00036&exec_mode=1&SsnId=', 'fujigoko-onsen/onsen007430/', 'https://www.fujiyamaonsen.jp/', 'fujiyama/'),
(23, 'ごてんば市営温泉会館', '35.291036690170664%2C138.9666062888855&z=16', 17, '静岡県', 2, '静岡県御殿場市深沢2160の1', '◯', '×', '◯', '', '×', '×', '10:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '500', '200', '800', '300', '', '月曜日', '221122X00738&exec_mode=1&SsnId=', '', 'http://gotemba-onsen.jp/', 'gotenbasieionsenkaikan/'),
(24, '須走温泉 天恵', '35.369068915586496%2C138.85911938888546&z=16', 21, '静岡県', 2, '静岡県駿東郡小山町須走112-171', '◯', '◯', '◯', '', '×', '◯', '11:00:00.0', '23:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '900', '500', '1500', '300', '', '年中無休', '221122294002&exec_mode=1&SsnId=', 'gotenba-onsen/onsen002687/', 'http://www.tokinosumika.com/tenkei/', 'tenkei/'),
(25, 'いずみの湯', '35.50406631893846%2C138.68481018888554&z=16', 22, '山梨県', 3, '山梨県南都留郡富士河口湖町西湖987', '◯', '◯', '◯', '', '×', '◯', '11:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '900', '500', '', '', '12月~3月]火・水　[4月~11月] 水', '', '191119X00468&exec_mode=1&SsnId=', '', 'https://www.hamayouresort.com/category/hotspa/?directory=hotspa', 'izumi-2/'),
(26, '富士眺望の湯 ゆらり', '35.476895742342194%2C138.69131738888552&z=16', 23, '山梨県', 3, '山梨県南都留郡鳴沢村8532-5', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '22:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1300', '650', '1500', '700', '', '年中無休', '19111929J002&exec_mode=1&SsnId=', 'fujigoko-onsen/onsen002066/', 'https://www.fuji-yurari.jp/', 'yurari/'),
(27, '泉水', '35.47932007553119%2C138.78417157354124&z=16', 24, '山梨県', 3, '山梨県富士吉田市上吉田4261', '◯', '◯', '◯', '', '◯', '◯', '10:00:00.0', '23:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '800', '500', '', '', '', '年中無休', '191119X00236&exec_mode=1&SsnId=', '', 'http://www.fuji-sensui.jp/', 'sensui/'),
(28, 'より道の湯', '35.558688283901404%2C138.9075825465576&z=16', 25, '山梨県', 3, '山梨県都留市つる1-13-31', '◯', '◯', '◯', '', '◯', '◯', '10:00:00.0', '23:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1280', '640', '', '', '', '年中無休', '191119X00484&exec_mode=1&SsnId=', 'tsuru-onsen/onsen016235/', 'http://yorimichinoyu.jp/', 'yorimitinoyu/'),
(29, '石割の湯', '35.43558349125005%2C138.90831467354133&z=16', 26, '山梨県', 3, '山梨県南都留郡山中湖村平野1450', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '800', '600', '', '', 'GW・7月8月は無休', '木曜日', '', '', 'http://www.ishiwarinoyu.jp/', 'isiwarinoyu/'),
(30, '道志の湯', '35.51469924029842%2C139.02476314655758&z=16', 27, '山梨県', 3, '山梨県南都留郡道志村池之原７５０１', '◯', '×', '◯', '', '×', '◯', '10:00:00.0', '20:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '700', '450', '', '', '年末年始', '火曜日', '', '', 'http://www.doshinoyu.jp/', 'dousinoyu/'),
(31, '紅富士の湯', '35.43081619690781%2C138.8420406888855&z=16', 28, '山梨県', 3, '山梨県南都留郡山中湖村山中865−776', '◯', '◯', '◯', '', '◯', '◯', '10:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '800', '600', '', '', '', '火曜日', '', '', 'http://www.benifuji.co.jp/', 'benifujinoyu/'),
(32, '紅椿の湯', '35.53477229178436%2C139.06185858888546&z=16', 29, '山梨県', 3, '山梨県南都留郡道志村小椿3888', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '21:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '1000', '500', '', '', '', '年中無休', '191119X00335&exec_mode=1&SsnId=', '', 'http://benitubakinoyu.com/', 'benitubakinoyu/'),
(33, '新湯治場 秋山温泉', '35.580700419709274%2C139.12454774229934&z=16', 30, '神奈川県', 1, '山梨県上野原市秋山2210', '◯', '◯', '◯', '', '×', '◯', '10:00:00.0', '20:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '00:00:00.0', '800', '600', '', '', '', '月曜日', '201119X00753&exec_mode=1&SsnId=', 'ootsuki-onsen/onsen002055/', 'http://www.akiyamaonsen.com/', 'akiyamaonsen/');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `onsen`
--
ALTER TABLE `onsen`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `onsen`
--
ALTER TABLE `onsen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;
